In [1]:
# (19/09/2022) Monday

# Lets Explore:
    
<img src='https://www.bing.com/th?id=ABT6E15325AC7028EF437C07408F91EDD36B3840FD2E558C4716C5045580268F329&w=608&h=200&c=2&rs=1&o=6&pid=SANGAM'>

**Castelmezzano, Italy:**

What may appear to be fire at the side of a mountain is actually the medieval village of Castelmezzano, considered one of Italyâ€™s most beautiful and undiscovered places. The town is perched along the western side of the San Martino mountains in the southern part of the Italian Peninsula. The population of Castelmezzano has found protection on these craggy cliffs since it was first settled by Greeks around 2,500 years ago. The villagers who live there today speak a distinct but dying variant of Italian, and with an aging population, the village is hopeful it can find new arrivals who appreciate the old ways.

If you're interested in a trip with a difference, the Volo dell'Angelo (Angel Flight) is a high-speed zip line across the valley between Castelmezzano and neighbouring Pietrapertosa that reaches speeds of more than 100 kilometres per hour more than 400 metres off the ground. Or consider the enchanting Percorso delle Sette Pietre (Seven Stones Path), a literary walk based on ancient stories handed down orally. The 2.5-kilometre-long path connects the villages of Castelmezzano and Pietrapertosa.

7:00pm - 9:30pm (PowerBi)


9:30pm - 10:00pm (Python)

In [2]:
import pandas as pd

In [3]:
result = pd.DataFrame({"student_name":['Asad', 'Ali', 'Faheem','Baber', 'Nasir'],
                       "student_roll":[123,456,321,678,111,],
                      "Paper1":[90,89,78,76,65],
                      "Paper2":[80,99,78,78,55],
                      "Paper3":[60,49,68,86,95]})

In [4]:
data = {
        'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year' : [2000, 2001, 2002, 2001, 2002, 2003],
        'pop'  : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
       }

In [5]:
result = pd.DataFrame(result)

In [6]:
result

  student_name  student_roll  Paper1  Paper2  Paper3
0         Asad           123      90      80      60
1          Ali           456      89      99      49
2       Faheem           321      78      78      68
3        Baber           678      76      78      86
4        Nasir           111      65      55      95

In [7]:
df = pd.DataFrame(data)

In [8]:
import numpy as np
df['Extra']=[2,np.nan,4,np.nan,6,np.nan]

In [9]:
df.index.name = 'year'
df.columns.name = 'state'

In [10]:
df

state   state  year  pop  Extra
year
0        Ohio  2000  1.5    2.0
1        Ohio  2001  1.7    NaN
2        Ohio  2002  3.6    4.0
3      Nevada  2001  2.4    NaN
4      Nevada  2002  2.9    6.0
5      Nevada  2003  3.2    NaN

# Reindexing

In [11]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [12]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [13]:
obj3 = pd.Series(obj,index=['a', 'b', 'c', 'd', 'e'])

In [14]:
obj3

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [15]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [16]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [17]:
obj3.reindex(range(6))

# resets index for you!

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [18]:
obj3.reindex(range(6), method='ffill') 

# forward fill = fills the value next to it!

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [19]:
obj3.reindex(range(6), method='bfill')

# backward fill = fills the value back to it!

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

# Dropping Entries from an Axis

In [20]:
result

  student_name  student_roll  Paper1  Paper2  Paper3
0         Asad           123      90      80      60
1          Ali           456      89      99      49
2       Faheem           321      78      78      68
3        Baber           678      76      78      86
4        Nasir           111      65      55      95

In [21]:
result.drop('Paper1', axis=1)

# Axis 1 = Column

# Axis 0 = Row

  student_name  student_roll  Paper2  Paper3
0         Asad           123      80      60
1          Ali           456      99      49
2       Faheem           321      78      68
3        Baber           678      78      86
4        Nasir           111      55      95

In [22]:
result.drop(0, axis=0)

  student_name  student_roll  Paper1  Paper2  Paper3
1          Ali           456      89      99      49
2       Faheem           321      78      78      68
3        Baber           678      76      78      86
4        Nasir           111      65      55      95

In [23]:
result.drop('Paper1', axis=1)

  student_name  student_roll  Paper2  Paper3
0         Asad           123      80      60
1          Ali           456      99      49
2       Faheem           321      78      68
3        Baber           678      78      86
4        Nasir           111      55      95

In [24]:
result

  student_name  student_roll  Paper1  Paper2  Paper3
0         Asad           123      90      80      60
1          Ali           456      89      99      49
2       Faheem           321      78      78      68
3        Baber           678      76      78      86
4        Nasir           111      65      55      95

In [25]:
result.drop("Paper2",axis=1,inplace=True)

In [26]:
result

  student_name  student_roll  Paper1  Paper3
0         Asad           123      90      60
1          Ali           456      89      49
2       Faheem           321      78      68
3        Baber           678      76      86
4        Nasir           111      65      95

In [27]:
result.dropna

#dropna : drops the null value

#fillna : fills the null value

<bound method DataFrame.dropna of   student_name  student_roll  Paper1  Paper3
0         Asad           123      90      60
1          Ali           456      89      49
2       Faheem           321      78      68
3        Baber           678      76      86
4        Nasir           111      65      95>

In [28]:
df

state   state  year  pop  Extra
year
0        Ohio  2000  1.5    2.0
1        Ohio  2001  1.7    NaN
2        Ohio  2002  3.6    4.0
3      Nevada  2001  2.4    NaN
4      Nevada  2002  2.9    6.0
5      Nevada  2003  3.2    NaN

In [29]:
df.dropna()

state   state  year  pop  Extra
year
0        Ohio  2000  1.5    2.0
2        Ohio  2002  3.6    4.0
4      Nevada  2002  2.9    6.0

In [30]:
df

state   state  year  pop  Extra
year
0        Ohio  2000  1.5    2.0
1        Ohio  2001  1.7    NaN
2        Ohio  2002  3.6    4.0
3      Nevada  2001  2.4    NaN
4      Nevada  2002  2.9    6.0
5      Nevada  2003  3.2    NaN

In [31]:
df.dropna(axis=1,how="any")

# any = if any value is found to be a null value, drops column or row

#all = if all value is found to be a null value, drops column or row

# thresh or threshold = if number of value is greater than null value, retain it else vice versa.

state   state  year  pop
year
0        Ohio  2000  1.5
1        Ohio  2001  1.7
2        Ohio  2002  3.6
3      Nevada  2001  2.4
4      Nevada  2002  2.9
5      Nevada  2003  3.2

In [32]:
df.dropna(axis=1,how="all")

state   state  year  pop  Extra
year
0        Ohio  2000  1.5    2.0
1        Ohio  2001  1.7    NaN
2        Ohio  2002  3.6    4.0
3      Nevada  2001  2.4    NaN
4      Nevada  2002  2.9    6.0
5      Nevada  2003  3.2    NaN

In [33]:
df.dropna(axis=1,thresh=4)

state   state  year  pop
year
0        Ohio  2000  1.5
1        Ohio  2001  1.7
2        Ohio  2002  3.6
3      Nevada  2001  2.4
4      Nevada  2002  2.9
5      Nevada  2003  3.2

In [34]:
# Done